[
    {
        "id": "vestmark",
        "title": "Software Engineer",
        "employer": "Vestmark, Inc.",
        "time": "Jul. 2024 - Present",
        "description": "I am an Associate Software Engineer on the Integrations team at Vestmark. My team is responsible for ensuring that clients have a smooth, seamless, custom experience on the VestmarkONE platform. I am responsible for quickly responding to bugs, meeting client requests, coordinating data flow, and adding new features to the robust VestmarkONE application.",
        "skills": [
            "Java",
            "SQL",
            "Cloud",
            "AWS",
            "Docker",
            "Agile",
            "Legacy Codebase"
        ],
        "image": "/images/vestmark.png"
    },
    {
        "id": "crit",
        "title": "Project Manager",
        "location": "Stony Brook University",
        "employer": "Campus Residences IT",
        "time": "Mar. 2022 - Dec. 2023",
        "description": "I led a growing team of student full-stack developers that work on several internal projects within the Campus Residences IT department. I was responsible for assigning programmers to tasks and overseeing the development of projects. My team primarily developed web apps for monitoring university IoT devices (like printers and TVs), and our apps are used by various teams throughout the university.",
        "skills": [
            "Leadership",
            "C# / .NET",
            "Postgres",
            "SQL",
            "React",
            "Javascript",
            "Vue",
            "Cloud",
            "Docker",
            "Legacy Codebase"
        ],
        "image": "/images/sbu-campres.png"
    },
    {
        "id": "crit-pt",
        "title": "IT Team Coordinator",
        "location": "Stony Brook University",
        "employer": "Campus Residences IT",
        "time": "Nov. 2019 - May 2022",
        "description": "I directed a team of 10-20 student technicians whose goal is to ensure that all printing/technology stations located around the campus are working smoothly and efficiently. This \"Print Team\" is a subset of the larger Campus Residences IT group - I coordinated the efforts of the Print Team with all other groups within C.R.I.T. to maximize effectiveness and efficiency.",
        "skills": [
            "Leadership",
            "Customer Service"
        ],
        "image": "/images/sbu-campres.png"
    },
    {
        "id": "ta",
        "title": "Teaching Assistant",
        "location": "Stony Brook University",
        "employer": "Systems Fundamentals",
        "time": "Aug. 2021 - Dec. 2021",
        "description": "As a TA, I assisted students in SBU's \"Systems Fundamentals I\" course, which teaches MIPS assembly, Boolean algebra, and the basics of CPU engineering. I held one-on-one office hours (3 hrs/week) to answer student questions, and assisted the professor by creating and proctoring various quizzes and exams.",
        "skills": [
            "Teaching",
            "Assembly",
            "Organization"
        ],
        "image": "/images/sbu-logo.png"
    },
    {
        "id": "launchpad",
        "title": "Contracted Developer",
        "links":[
            {
                "display": "LaunchPad",
                "url": "https://launchpadduo.com/"
            }
        ],
        "employer": "LaunchPad",
        "time": "Sep. 2020 - Jan. 2021",
        "description": "I was contracted by LaunchPad, an advertizing analytics startup company, to completely overhaul their product's web app. I was able to analyze their existing codebase and remove a considerable number of redundancies, while implementing a more modular and feature-rich API.",
        "skills": [
            "Legacy Codebase",
            "Javascript",
            "HTML/CSS"
        ],
        "image": "/images/launchpad-logo.png"
    }
]
